spec/artillery-load-test.yml
config:
  target: http://127.0.0.1:5555
  phases:
    - duration: 60
      arrivalRate: 1
      rampTo: 5
      name: Warm up phase
    - duration: 60
      arrivalRate: 5
      rampTo: 10
      name: Ramp up load
    - duration: 30
      arrivalRate: 10
      rampTo: 30
      name: Spike phase
  # Load & configure a couple of useful plugins
  # https://docs.art/reference/extensions
  plugins:
    ensure: {}
    apdex: {}
    metrics-by-endpoint: {}
  apdex:
    threshold: 100
  ensure:
      thresholds:
        - http.response_time.p99: 500
        - http.response_time.p95: 375
scenarios:
  - flow:
      - loop:
        - get:
            url: "/api/population/state/michigan/city/rochester"
        - get:
            url: "/api/population/state/colorado/city/denver"
        - get:
            url: "/api/population/state/michigan/city/detroit"
        - get:
            url: "/api/population/state/michigan/city/lansing"
        count: 100